app/controllers/artists_controller.rb

  def index
    if params[:song_id]
      @songs = Song.find(params[:song_id])
    else
      @artists = Artist.all
---
SELECT "artists".* FROM "artists"